# 张凡凡 - Web 前端工程师

---


# 联系方式
（HR会打印你的简历，用于在面试的时候联系，所以联系方式放到最上边会比较方便）

- 手机：18500201620
- Email：zfandf@163.com
- QQ：775434963

---

# 个人信息

- 张凡凡/女/1988
- 本科/河南科技大学/2008-2012
- 工作年限：3年
- 技术博客：http://blog.fflove.top
- Github: http://github.com/zfandf
- 期望职位: Web前端工程师
- 期望薪资：税前月薪8k~10k，特别喜欢的公司可例外
- 期望城市：郑州 

---

# 工作经历

## 北京觅我信息技术有限公司 （ 2012年9月 ~ 2015年5月 ）

### ConnectMe
项目介绍: ConnectMe 是一款安卓手机软件, 以手机作为服务器,  在电脑上不需要安装客户端, 无需数据线, 可以通过浏览器管理手机. 该项目使用 Gulp 进行构建, 使用 sass 编辑和维护 CSS, 使用 ajax 进行数据交互. 

责任描述:  在此项目中我主要负责前端页面的开发, 负责模块: 音乐管理, 视频管理, 图片管理, 文件上传, 联系人管理等. 其中上传使用了 dropzone.js 插件进行扩展. 音乐和视频播放用类的形式自定义播放器插件. 并使用原生 js 自定义滚动条.


### 淘身边便利
项目介绍:  淘身边便利是一个 O2O 项目, 将线下超市搬到线上进行, 分用户端和店铺端. 用户通过买家端定位查找附近超市下单, 店铺端接单配送. 支付有在线支付和货到付款, 微信买家端支持支付宝和微信两种线上支付方式.

责任描述: 

- 微信买家版:  微信买家版又分为两部分, 一部分是手机网页, 主要有店铺列表, 商品列表, 下单, 收货地址, 抢单, 评价和投诉几个页面, 页面测试可在Android 2.3.6 版本上通过. 另一部分是微信交互, 这个我只是中间接手过一段, 但对微信公众账号使用文档还算熟悉.
- 卖家 PC 版：卖家 PC 版主要在超市收银机上使用, 使用 Qt 做外壳, 内部嵌套网页. 
- 编辑后台：该系统使用了 Bootstrap 框架. 是整个淘身边便利项目的管理中心, 可查看编辑订单状态, 录入店铺信息, 商品信息, 商品分类. 管理用户, 更改系统配置等等. 
- 淘身边便利官网:  [http://www.tshenbian.com/](http://www.tshenbian.com/)

### 其他项目

- 觅我官网:  http://www.m15.cn/
- 爱配件官网: http://www.gopeijian.com/
- 爱配件淘宝 u 站: http://ipeijian.uz.taobao.com/
- 爱配件编辑后台
- 爆款编辑后台
- 爆款爬虫(抓取特价商品)
- 爱配件统计后台: ExtJs
- 淘身边统计后台: jQuery + Datatables + Highcharts

---

# 技能清单

以下均为我熟练使用的技能

- Web开发：PHP
- 前端框架：Bootstrap/HTML5
- 前端工具：Bower/Gulp/SaSS
- 数据库相关：MySQL
- 版本管理、文档和自动化部署工具：Svn/Git/PHPDoc
- 单元测试：PHPUnit/Qunit
- 云和开放平台：SAE/BAE/AWS/微博开放平台/微信应用开发


---

# 致谢
感谢您花时间阅读我的简历，期待能有机会和您成为同事。
